Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: By default, a scheduled method is executed on the main executor for blocking tasks. As a result, a technology that is designed to run on a Vert.x event loop (such as Hibernate Reactive) cannot be used inside the method body. For this reason, a scheduled method that returns `java.util.concurrent.CompletionStage<Void>` or `io.smallrye.mutiny.Uni<Void>`, or is annotated with `@io.smallrye.common.annotation.NonBlocking` is executed on the Vert.x event loop instead.
ja_jp: デフォルトでは、スケジュールされたメソッドは、ブロックするタスクのメインエクゼキュータ上で実行されます。 そのため、Vert.xイベントループ上で実行するように設計された技術（Hibernate Reactiveなど）は、メソッド本体内で使用することができません。 このため、 `java.util.concurrent.CompletionStage<Void>` または `io.smallrye.mutiny.Uni<Void>` を返す、あるいは `@io.smallrye.common.annotation.NonBlocking` でアノテーションされたスケジュール型メソッドは、代わりに Vert.x のイベントループで実行されます。

source: By default, a single producer can transmit messages in a channel. Having multiple producers is considered erroneous and is reported at deployment time. The `@Merge` annotation changes this behavior and indicates that a channel can have multiple producers. `@Merge` must be used with the `@Incoming` annotation:
ja_jp: デフォルトでは、単一のプロデューサーがチャネル内でメッセージを送信できます。 複数のプロデューサーが存在するとエラーとみなされ、デプロイメント時に報告されます。 `@Merge` アノテーションはこの動作を変更し、チャネルに複数のプロデューサーが存在する可能性があることを示します。 `@Merge` は `@Incoming` アノテーションと一緒に使用する必要があります。

source: By default, a synthetic bean is initialized during `STATIC_INIT`.
ja_jp: デフォルトでは、合成 Bean は `STATIC_INIT` の間に初期化されます。

source: By default, a tag template cannot reference the data from the parent context. Qute executes the tag as an _isolated_ template, i.e. without access to the context of the template that calls the tag. However, sometimes it might be useful to change the default behavior and disable the isolation. In this case, just add `_isolated=false` or `_unisolated` argument to the call site, for example `{#itemDetail item showImage=true _isolated=false /}` or `{#itemDetail item showImage=true _unisolated /}`.
ja_jp: デフォルトでは、タグテンプレートは親コンテキストからデータを参照できません。 Qute はタグを _分離された_ テンプレートとして実行します。つまり、タグを呼び出すテンプレートのコンテキストにアクセスしません。 ただし、デフォルトの動作を変更して分離を無効にすると便利な場合があります。 その場合、呼び出しサイトに `_isolated=false` または `_unisolated` 引数を追加するします (例: `{#itemDetail item showImage=true _isolated=false /}` または `{#itemDetail item showImage=true _unisolated /}`)。

source: By default, a template with one of the following content types is escaped: `text/html`, `text/xml`, `application/xml` and `application/xhtml+xml`. However, it's possible to extend this list via the `quarkus.qute.escape-content-types` configuration property.
ja_jp: デフォルトでは、`text/html`、`text/xml`、`application/xml` および `application/xhtml+xml` コンテンツタイプのいずれかを持つテンプレートがエスケープされます。しかし、`quarkus.qute.escape-content-types` 設定プロパティーで、このリストを拡張することができます。

source: By default, a token `groups` array claim is expected to contain roles. The `realm_access/roles` and `realm_access/<client-id>/roles` claims are also checked in case the token was issued by Keycloak. But if the token has another custom claim containing roles, you can point to it with `quarkus.oidc.roles.role-claim-path`. It can be used to select a top-level array claim or a nested claim using a `/` path separator. Make sure to use double quotes for namespace qualified claim names, for example, `quarkus.oidc.roles.role-claim-path="http://auth0.customroles/roles"`.
ja_jp: デフォルトでは、トークンの `groups` 配列クレームにロールが含まれていることが期待されます。トークンが Keycloak によって発行された場合に備えて、`realm_access/roles` および `realm_access/<client-id>/roles` クレームもチェックされます。しかし、トークンにロールを含む別のカスタムクレームがある場合は、`quarkus.oidc.roles.role-claim-path` でそれを指定できます。これを使用して、最上位の配列クレームや、`/` パスセパレーターを使用したネストされたクレームを選択できます。名前空間で修飾されたクレーム名には、必ず `quarkus.oidc.roles.role-claim-path="http://auth0.customroles/roles"` のように二重引用符を使用してください。

source: By default, a unique id is generated for each scheduled method. This id is used in log messages and during debugging. Sometimes a possibility to specify an explicit id may come in handy.
ja_jp: デフォルトでは、スケジュールされた各メソッドに対して一意の ID が生成されます。このIDはログメッセージやデバッグ中に使用されます。時には、明示的な id を指定することが便利な場合もあります。

source: By default, a unique identifier is generated for each scheduled method. This identifier is used in log messages, during debugging and as a parameter of some `io.quarkus.scheduler.Scheduler` methods. Therefore, a possibility to specify an explicit identifier may come in handy.
ja_jp: デフォルトでは、スケジュールされた各メソッドに対して一意の ID が生成されます。このIDはログメッセージやデバッグ中に使用されます。時には、明示的な id を指定することが便利な場合もあります。

source: By default, all available contexts are propagated. However, you can override this behaviour in several ways.
ja_jp: デフォルトでは、利用可能なすべてのコンテキストが伝搬されます。しかし、この動作をいくつかの方法で上書きすることができます。

source: By default, all commands are sent to a master node (if the command has a key, it is the master node of the shard that owns the key, otherwise it is a random master node). It is possible to configure the Redis client to send read-only commands (queries) to replica nodes. Set the `quarkus.redis.replicas` configuration property to:
ja_jp: デフォルトでは、すべてのコマンドはマスターノードに送信されます (コマンドにキーがある場合は、キーを所有するシャードのマスターノード、それ以外の場合はランダムマスターノード)。 Redis クライアントを設定して、レプリカノードに読み取り専用コマンド (クエリー) を送信することが可能です。 `quarkus.redis.replicas` 設定プロパティーを次のように設定します。

source: By default, all commands are sent to the master node. It is possible to configure the Redis client to send read-only commands (queries) to replica nodes. Set the `quarkus.redis.replicas` configuration property to:
ja_jp: デフォルトでは、すべてのコマンドはマスターノードに送信されます。 Redis クライアントを設定して、レプリカノードに読み取り専用コマンド (クエリー) を送信することが可能です。 `quarkus.redis.replicas` 設定プロパティーを次のように設定します。

source: By default, all files located in the `src/main/resources/templates` directory and its subdirectories are registered as templates. Templates are validated during startup and watched for changes in the development mode.
ja_jp: デフォルトでは、 `src/main/resources/templates` ディレクトリーとそのサブディレクトリーにあるすべてのファイルがテンプレートとして登録されます。開発モードではテンプレートは起動時に検証され、変更が監視されます。

source: By default, all the logout parameters are serialized as logout URL query parameters. Some OIDC providers may require that logout parameters are encoded as HTML form values and auto-submitted in the browser with the HTTP POST method and the `application/x-www-form-urlencoded` content type: set `quarkus.oidc.logout.logout-mode=form-post` in this case.
ja_jp: デフォルトでは、すべてのログアウトパラメーターはログアウト URL のクエリーパラメーターとしてシリアル化されます。一部の OIDC プロバイダーでは、ログアウトパラメーターを HTML フォーム値としてエンコードし、ブラウザーから HTTP POST メソッドおよび `application/x-www-form-urlencoded` コンテンツタイプで自動送信することを要求する場合があります。その場合は、 `quarkus.oidc.logout.logout-mode=form-post` を設定してください。

source: By default, all the methods from a gRPC service run on the event loop. As a consequence, you must **not** block. If your service logic must block, annotate the method with `io.smallrye.common.annotation.Blocking`:
ja_jp: デフォルトでは、gRPCサービスからのすべてのメソッドはイベントループ上で実行されます。そのため、ブロックしては *いけません* 。サービスロジックをブロックする必要がある場合は、メソッドに `io.smallrye.common.annotation.Blocking` アノテーションを追加します。

source: By default, applications using the `quarkus-oidc` extension are marked as a `service` type application (see `quarkus.oidc.application-type`). This extension also supports only `web-app` type applications but only if the access token returned as part of the authorization code grant response is marked as a source of roles: `quarkus.oidc.roles.source=accesstoken` (`web-app` type applications check ID token roles by default).
ja_jp: デフォルトでは、 `quarkus-oidc` エクステンションを使用するアプリケーションは、 `service` タイプのアプリケーションとしてマークされます（ `quarkus.oidc.application-type` 参照）。また、このエクステンションは、 `web-app` タイプのアプリケーションのみをサポートしますが、認可コード付与応答の一部として返されたアクセストークンが、ロールのソースとしてマークされている場合に限ります： `quarkus.oidc.roles.source=accesstoken` ( `web-app` タイプのアプリケーションは、デフォルトでIDトークンのロールをチェックします)。

source: By default, applications using the `quarkus-oidc` extension are treated as `service` type applications. However, the extension also supports `web-app` type applications under the following conditions:
ja_jp: デフォルトでは、 `quarkus-oidc` エクステンションを使用するアプリケーションは `service` タイプのアプリケーションとして扱われます。 ただし、エクステンションは、次の条件下では `web-app` タイプのアプリケーションもサポートします。

source: By default, at least one of the permissions specified through one annotation instance is required. You can require all permissions by setting `inclusive=true`. Both resource methods `createOrUpdate` have equal authorization requirements.
ja_jp: デフォルトでは、1 つのアノテーションインスタンスを通じて指定された権限の少なくとも 1 つが必要です。 `inclusive=true` を設定することで、すべての権限を要求することができます。 両方のリソースメソッド `createOrUpdate` には同等の認可要件があります。

source: By default, constraint violation messages will be returned in the build system locale.
ja_jp: デフォルトでは、制約違反のメッセージはビルドシステムのロケールで返されます。

source: By default, due to the fact that maps are hard to model in a schema (as the keys and values can be dynamic at runtime) GraphQL does not support maps by default. Using the above adaption, `Map` support is added for Quarkus and are mapped to an `Entry<Key,Value>` with an optional key parameter. This allows you to return a map, and optionally query it by key.
ja_jp: デフォルトでは、マップはスキーマでモデル化するのが難しいため（キーと値が実行時に動的になる可能性があるため）、 GraphQL はデフォルトでマップをサポートしません。 上記の適応により、Quarkusでは `Map` のサポートが追加され、オプションのキーパラメータを持つ `Entry<Key,Value>` にマップされるようになりました。 これにより、マップを返すことができ、オプションでキーでクエリを実行することができます。

source: By default, entities are cached in regions named after their fully qualified name, e.g. `org.acme.Country`.
ja_jp: デフォルトでは、エンティティは、その完全修飾名を冠した領域（例えば、 `org.acme.Country`）にキャッシュされます。

source: By default, even external links will render inside (embedded) in Dev UI. In the case of HTML, the page will be rendered, and any other content will be shown using https://codemirror.net/[code-mirror] to markup the media type. For example, the OpenAPI schema document in YAML format:
ja_jp: デフォルトでは、外部リンクも Dev UI の内部 (埋め込み) でレンダリングされます。HTML の場合、ページがレンダリングされ、その他のコンテンツはメディアタイプをマークアップするために link:https://codemirror.net/[code-mirror] を使用して表示されます。たとえば `yaml` 形式のOpenAPI スキーマドキュメントは、次のようになります。

source: By default, if one role is configured, a RoleBinding resource will be generated as well to link this role with the ServiceAccount resource.
ja_jp: デフォルトでは、1つのロールが設定されている場合、このロールとServiceAccountリソースをリンクするためのRoleBindingリソースも生成されます。

source: By default, if you include both a JDBC extension (+ Agroal) and a reactive datasource extension handling the given database kind, both will be created.
ja_jp: デフォルトでは、JDBC 拡張 (+ Agroal) と、指定したデータベースの種類を扱うリアクティブデータソース拡張の両方を含めると、これらのファイル両方が作成されます。

source: By default, in `dev` and `test` modes, Hibernate ORM, upon boot, will read and execute the SQL statements in the `/import.sql` file (if present). You can change the file name by changing the property `quarkus.hibernate-orm.sql-load-script` in `application.properties`.
ja_jp: `dev` および `test` モードのデフォルトでは、Hibernate ORM は起動時に `/import.sql` ファイル内の SQL 文を読み込んで実行します（存在する場合）。 `application.properties` のプロパティ `quarkus.hibernate-orm.sql-load-script` を変更することで、ファイル名を変更することができます。

source: By default, in `dev` and `test` modes, Hibernate ORM, upon boot, will read and execute the SQL statements in the `/import.sql` file (if present). You can change the file name by changing the property `quarkus.hibernate-orm.sql-load-script` in `application.properties`. You can also provide a `.zip` file in the same way which should contain only the files containing the SQL statements to be executed.
ja_jp: デフォルトでは、 `dev` および `test` モードにおいて、Hibernate ORM は起動時に (存在すれば) `/import.sql` ファイル内の SQL 文を読み込んで実行します。 `application.properties` の `quarkus.hibernate-orm.sql-load-script` プロパティーを変更することでファイル名を変更できます。また、実行対象の SQL 文を含むファイルのみを格納した `.zip` ファイルを同様の方法で提供することも可能です。

source: By default, in-memory channels dispatch messages on the caller thread of the `InMemorySource#send` method, which would be the main thread in unit tests. However, most of the other connectors handle context propagation dispatching messages on separate duplicated Vert.x contexts.
ja_jp: デフォルトでは、in-memory チャネルは、ユニットテストのメインスレッドとなる `InMemorySource#send` メソッドの呼び出し元スレッドでメッセージをディスパッチします。 ただし、他のほとんどのコネクターは、個別の複製された Vert.x コンテキストでコンテキスト伝播ディスパッチメッセージを処理します。

source: By default, in-memory channels dispatch messages on the caller thread, which would be the main thread in unit tests.
ja_jp: デフォルトでは、メモリー内チャネルは呼び出し元スレッド (ユニットテストのメインスレッド) にメッセージをディスパッチします。

source: By default, inclusive authentication requires that all registered HTTP authentication mechanisms must create the `SecurityIdentity`. However, in the lax mode, the authentication succeeds if at least one registered `HttpAuthenticationMechanism` created the `SecurityIdentity`.
ja_jp: デフォルトでは、統合認証では、登録されているすべての HTTP 認証メカニズムが `SecurityIdentity` を作成する必要があります。 ただし、lax モードでは、少なくとも 1 つの登録済み `HttpAuthenticationMechanism` が `SecurityIdentity` を作成すると、認証が成功します。

source: By default, incoming methods receive each Kafka record individually. Under the hood, Kafka consumer clients poll the broker constantly and receive records in batches, presented inside the `ConsumerRecords` container.
ja_jp: デフォルトでは、着信メソッドは各 Kafka レコードを個別に受信します。内部的には、Kafka コンシューマークライアントはブローカーを絶えずポーリングし、 `ConsumerRecords` コンテナー内に表示されるレコードをバッチで受信します。

source: By default, incoming methods receive each Pulsar message individually. You can enable batch mode using `batchReceive=true` property, or setting a `batchReceivePolicy` in consumer configuration.
ja_jp: デフォルトでは、incoming メソッドは各 Pulsar メッセージを個別に受信します。 `batchReceive=true` プロパティーを使用するか、コンシューマー設定で `batchReceivePolicy` を指定することで、バッチモードを有効にすることができます。

source: By default, integration tests both *build* and *run* the native executable using the `prod` profile.
ja_jp: デフォルトでは、インテグレーションテストは `prod` プロファイルを使用して、ネイティブ実行可能ファイルに対して *build* と *run* の両方を行います。

source: By default, interception is only supported for managed beans (also known as class-based beans). To support interception of producer methods and synthetic beans, the CDI specification includes an `InterceptionFactory`, which is a runtime oriented concept and therefore cannot be supported in Quarkus.
ja_jp: デフォルトでは、インターセプションはマネージド Bean (クラスベース Bean とも呼ばれます) に対してのみサポートされます。 プロデューサーメソッドと合成 Bean のインターセプションをサポートするために、CDI 仕様には `InterceptionFactory` が含まれていますが、これはランタイム指向の概念であるため、Quarkus ではサポートできません。

source: By default, interceptor beans annotated with `@PersistenceUnitExtension` are application-scoped, which means only one interceptor instance will be created per application and reused across all entity managers. For this reason, the interceptor implementation must be thread-safe.
ja_jp: デフォルトでは、 `@PersistenceUnitExtension` アノテーションの付けられたインターセプター Beanはアプリケーションスコープになります。つまり、アプリケーションごとにインターセプターのインスタンスが一つのみ作成され、すべてのエンティティマネージャーで再利用されます。このため、インターセプターの実装はスレッドセーフである必要があります。

source: By default, it expects roles in a space delimited list enclosed in brackets i.e. `[ user admin ]`. You can specify the regular expression to use to find individual roles in the claim string too:
ja_jp: デフォルトでは、ロールが括弧で囲んだスペース区切りのリスト（例： `[ user admin ]` ）に入っていることを想定しています。クレーム文字列から個々のロールを検索するために使用する正規表現を指定することも可能です:

source: By default, it is assumed that the `\*.proto` files are located in the `src/main/proto` directory. You can configure this location using the `quarkus.grpc.codegen.proto-directory` property in your **build descriptor**.
ja_jp: デフォルトでは、 `\*.proto` ファイルは `src/main/proto` ディレクトリーにあると想定されます。 この場所は、**ビルド記述子** の `quarkus.grpc.codegen.proto-directory` プロパティーを使用して設定できます。

source: By default, logout is based on the expiration time of the ID token issued by the OIDC provider. When the ID token expires, the current user session at the Quarkus endpoint is invalidated, and the user is redirected to the OIDC provider again to authenticate. If the session at the OIDC provider is still active, users are automatically re-authenticated without needing to provide their credentials again.
ja_jp: デフォルトでは、ログアウトはOIDCプロバイダによって発行されたIDトークンの有効期限に基づいて行われます。 IDトークンの有効期限が切れると、Quarkusエンドポイントでの現在のユーザーセッションは無効になり、ユーザーは認証のために再度OIDCプロバイダーにリダイレクトされます。 OIDCプロバイダのセッションがまだ有効な場合、ユーザーは再度クレデンシャルを入力することなく、自動的に再認証されます。

source: By default, logout is based on the expiration time of the ID token issued by the OIDC provider. When the ID token expires, the current user session at the Quarkus endpoint is invalidated, and the user is redirected to the OIDC provider to authenticate again. If the session at the OIDC provider is still active, users are automatically re-authenticated without having to provide their credentials again.
ja_jp: デフォルトでは、ログアウトは OIDC プロバイダーによって発行された ID トークンの有効期限に基づいて行われます。 ID トークンの有効期限が切れると、Quarkus エンドポイントでの現在のユーザーセッションは無効になり、ユーザーは認証のために再度 OIDC プロバイダーにリダイレクトされます。 OIDC プロバイダーのセッションが引き続きアクティブな場合、ユーザーは再度クレデンシャルを入力することなく、自動的に再認証されます。

source: By default, logs of the underlying database are not exposed. By capturing the logs, they become visible amongst other log statements:
ja_jp: デフォルトでは、基礎となるデータベースのログは公開されません。 ログをキャプチャすることで、ログは他のログ文の中から見えるようになります：

source: By default, management endpoints will be exposed on: `http://0.0.0.0:9000/q`. For example, if you have `smallrye-health` installed, the readiness probe will be exposed at `http://0.0.0.0:9000/q/health/ready`.
ja_jp: デフォルトでは、管理エンドポイントは `http://0.0.0.0:9000/q` で公開されます。たとえば、`smallrye-health` をインストールしている場合、readiness probe は `http://0.0.0.0:9000/q/health/ready` で公開されます。

source: By default, messages transmitted in a channel are only dispatched to a single consumer. Having multiple consumers is considered an error and is reported at deployment time.
ja_jp: デフォルトでは、チャネルで送信されるメッセージは単一のコンシューマーにのみディスパッチされます。 複数のコンシューマーが存在するとエラーとみなされ、デプロイメント時に報告されます。

source: By default, methods annotated with `@ServerExceptionMapper` do **not** run CDI interceptors that apply to the other methods of the class (like ones needed for implementing security method level security).
ja_jp: デフォルトでは、 `@ServerExceptionMapper` アノテーションが付与されたメソッドは、クラス内の他のメソッドに適用される CDI インターセプターを **実行しません** (セキュリティのメソッドレベルの保護を実装するために必要なものなど)。

source: By default, native tests runs using the `prod` profile. This can be overridden using the `quarkus.test.native-image-profile` property. For example, in your `application.properties` file, add: `quarkus.test.native-image-profile=test`. Alternatively, you can run your tests with: `./mvnw verify -Pnative -Dquarkus.test.native-image-profile=test`. However, don't forget that when the native executable is built the `prod` profile is enabled. So, the profile you enable this way must be compatible with the produced executable.
ja_jp: デフォルトでは、ネイティブテストは `prod` プロファイルを使用して実行されます。これは `quarkus.test.native-image-profile` プロパティーを使用して上書きすることができます。たとえば、 `application.properties` ファイルに `quarkus.test.native-image-profile=test` を追加します。あるいは、次のようにしてテストを実行することもできます: `./mvnw verify -Pnative -Dquarkus.test.native-image-profile=test` .ただし、ネイティブ実行可能ファイルがビルドされたときに `prod` プロファイルが有効になっていることを忘れないでください。したがって、この方法で有効にしたプロファイルは、生成された実行ファイルと互換性がなければなりません。

source: By default, no <<template-locator,template locators>> are registered, i.e. `Engine.getTemplate(String)` will not work.
ja_jp: デフォルトでは、<<template-locator,template locators>> は登録されていません。つまり、`Engine.getTemplate(String)` は機能しません。

source: By default, no xref:template-locator[template locators] are registered, i.e. `Engine.getTemplate(String)` will not work.
ja_jp: デフォルトでは、 xref:template-locator[テンプレートロケーター] は登録されていません。つまり、 `Engine.getTemplate(String)` は機能しません。

source: By default, only SQL statement executions are traced. Connection acquisition from the datasource (`getConnection()` calls) is not traced. To also trace connection acquisition, enable it explicitly:
ja_jp: デフォルトでは、SQL 文の実行のみがトレースされます。 データソースからの接続取得 ( `getConnection()` 呼び出し) はトレースされません。 接続の取得もトレースするには、明示的に有効にしてください:

source: By default, only failing the validation of the constraints defined for the parameters of the REST endpoints will result in bad request responses with a validation report as a part of the response body. In any other case, e.g. validation of service methods (be it parameters or return values), validation of the return value of a REST endpoint, etc., will result in an internal server error (response status code `5xx`), unless the application code explicitly catches and handles the `ConstraintViolationException` (or a custom `ExceptionMapper` is implemented). The reasoning behind such behaviour is that only REST endpoint parameters are considered as the user input and hence can be treated as a bad request (response status code `4xx`), At the same time, constraint violations in other places result from the application logic execution and, hence, are treated as internal errors.
ja_jp: デフォルトでは、RESTエンドポイントのパラメーターに定義された制約の検証に失敗した場合にのみ、レスポンスボディの一部として検証レポートを含む不正なリクエスト応答が返されます。その他のケース、例えばサービスメソッド（パラメーターであれ戻り値であれ）の検証、RESTエンドポイントの戻り値の検証などは、アプリケーションコードが明示的に `ConstraintViolationException` をキャッチして処理しない限り（またはカスタムの `ExceptionMapper` が実装されていない限り）、内部サーバーエラー（応答ステータスコード `5xx`）となります。このような動作の理由は、RESTエンドポイントのパラメーターのみがユーザー入力と見なされ、したがって不正なリクエスト（応答ステータスコード `4xx`）として扱われるためです。同時に、他の場所での制約違反はアプリケーションロジックの実行に起因するため、内部エラーとして扱われます。

source: By default, only the `response_type` (set to `code`), `scope` (set to 'openid'), `client_id`, `redirect_uri` and `state` properties are passed as HTTP query parameters to the OpenID Connect provider's authorization endpoint when the user is redirected to it to authenticate.
ja_jp: デフォルトでは、ユーザーが認証のために OpenID Connect プロバイダーにリダイレクトした際に、 `response_type` (`code` に設定)、 `scope` ('openid' に設定)、 `client_id`、 `redirect_uri` および `state` プロパティーのみが HTTP クエリーパメータとして渡されています。

source: By default, only the `response_type` (set to `code`), `scope` (set to `openid`), `client_id`, `redirect_uri`, and `state` properties are passed as HTTP query parameters to the OIDC provider's authorization endpoint when the user is redirected to it to authenticate.
ja_jp: デフォルトでは、ユーザーが認証のために OIDC プロバイダーの認可エンドポイントにリダイレクトされる際に、 `response_type` (`code` に設定)、 `scope` (`openid` に設定)、 `client_id`、 `redirect_uri`、および `state` プロパティーのみが HTTP クエリーパラメーターとして、OIDC プロバイダーの認可エンドポイントに渡されます。

source: By default, only the config properties from `application.properties` and properties set by the `@TestConfigProperty` annotation or with the `QuarkusComponentTestExtensionBuilder#configProperty(String, String)` method are included in the test config. System properties and ENV variables are _not_ included in the test config by default. However, you can use `@QuarkusComponentTest#useSystemConfigSources()` or `QuarkusComponentTestExtensionBuilder#useSystemConfigSources()` to configure this behavior.
ja_jp: デフォルトでは、`application.properties` の設定プロパティーと、`@TestConfigProperty` アノテーションまたは `QuarkusComponentTestExtensionBuilder#configProperty(String, String)` メソッドで設定されたプロパティーのみがテスト設定に含まれます。システムプロパティーと環境変数 (ENV variables) は、デフォルトではテスト設定に _含まれません_。しかし、`@QuarkusComponentTest#useSystemConfigSources()` または `QuarkusComponentTestExtensionBuilder#useSystemConfigSources()` を使用して、この動作を設定できます。

source: By default, passwords are stored and hashed by using https://en.wikipedia.org/wiki/Bcrypt[bcrypt] under the https://en.wikipedia.org/wiki/Crypt_(C)[Modular Crypt Format] (MCF).
ja_jp: デフォルトでは、link:https://en.wikipedia.org/wiki/Crypt_(C)[Modular Crypt Format] (MCF) のもと、link:https://en.wikipedia.org/wiki/Bcrypt[bcrypt] を用いてパスワードの保存とハッシュ化が行われます。

source: By default, priority load shedding is enabled, which means a request is only rejected if the current CPU load is high enough. To determine whether a request should be rejected, 2 attributes are considered:
ja_jp: デフォルトでは、優先負荷制限が有効になっています。つまり、現在の CPU 負荷が十分に高い場合にのみ、リクエストが拒否されます。 リクエストを拒否するかどうかを判断するには、次の 2 つの属性が考慮されます。

source: By default, quarkus-grpc starts a single gRPC server running on a single event loop.
ja_jp: デフォルトでは、quarkus-grpcは単一のイベントループ上で動作する単一のgRPCサーバーを起動します。

source: By default, static files are exposed under the `/static` endpoint.
ja_jp: デフォルトでは、静的ファイルは `/static` エンドポイントの下で公開されます。
